from enum import IntEnum

class CharacterType(IntEnum):
    孙悟空 = 0
    猪八戒 = 1
    沙悟净 = 2
    二郎神 = 3
    小龙女 = 4
    铁扇   = 5
    紫衣   = 6
    嫦娥   = 7
    唐三藏 = 8
    蜘蛛精 = 9

class WeaponType(IntEnum):
    # 孙悟空
    金箍棍 = 1
    通天棍 = 2
    蟠龙破岩棍 = 3
    双炼神棒 = 4
    六轮烈日棍 = 5
    天罡棍 = 6
    超大圣 = 7
    不动龙棍 = 8
    猿神擎天柱 = 9

    # 猪八戒
    九齿 = 10
    妖魔忏 = 11
    异界轮回 = 12
    神兽牙 = 13
    四季钉粑 = 14
    地煞星 = 15
    狱齿 = 16
    天罚钉 = 17
    巨豚钉 = 18

    # 沙悟净
    降魔宝杵 = 19
    黑河月牙铲 = 20
    金刚 = 21
    北辰 = 22
    水妖月牙 = 23
    降魔金刚杵 = 24
    寒冰冻镜铲 = 25
    天狼 = 26
    无常 = 27

    # 二郎神
    方天 = 28
    霸气枪 = 29
    十字天轮 = 30
    驹逢鹏翼枪 = 31
    八方天外 = 32
    翼影枪 = 33
    啸天十字枪 = 34
    圣君十字轮 = 35
    焦炎绝翼枪 = 36

    # 小龙女
    疾风镰 = 37
    龙神爪破 = 38
    龙鳞切 = 39
    天魔双刃刃 = 40
    大旋风 = 41
    迦罗切 = 42
    饕餮无影爪 = 43
    冷翼双刃 = 44
    白龙双翼刃 = 45

    # 铁扇
    铁扇 = 46
    芭蕉扇 = 47
    凤凰焰羽扇 = 48
    清风扇 = 49
    如意宝扇 = 50
    阴阳浦扇 = 51
    弥勒喜福扇 = 52
    凶鸟羽扇 = 53
    金羽散翅扇 = 54

    # 紫衣
    无名剑 = 55
    紫蝶 = 56
    辟邪剑 = 57
    光霸天 = 58
    紫砂剑 = 59
    牡丹 = 60
    八百银花 = 61
    切光 = 62
    七星龙渊 = 63

    # 嫦娥
    天宫伞 = 64
    八宝伞 = 65
    天伞_弦月 = 66
    灵气宝伞 = 67
    五色伞 = 68
    天伞_满月 = 69
    花好月圆 = 70
    月下舞伞 = 71
    妖伞_叠雨 = 72

    # 唐三藏
    九锡 = 73
    宝轮 = 74
    佛光遍照 = 75
    虚无 = 76
    八十八佛 = 77
    大极乐 = 78
    四大皆空 = 79
    因果 = 80
    先知 = 81
    
    # 蜘蛛精
    蜘蛛牙 = 82
    狼蜘蛛牙 = 83
    罪之一方 = 84
    零度之吻 = 85
    豺狼爪牙 = 86
    血腥淑女 = 87
    黑寡妇 = 88
    灾害 = 89
    蚩尤鬼手 = 90

class HatType(IntEnum):
    # 帽子
    通天冠 = 91
    黄袍冠 = 92
    死骨发饰 = 93
    玄武冠 = 94
    麒麟冠 = 95
    凤驱冠 = 96
    螭冠 = 97
    天爆碎炎冠 = 98
    阎王冠 = 99
    洛神冠 = 100
    紫金八卦镜 = 112
    箕星冠 = 125
    辰砂冠 = 128
    业火冠 = 131
    霜莲露雨簪 = 134
    的驴战盔 = 137
    翡翠明冠 = 140

class ClothesType(IntEnum):
    # 衣服
    护法袈裟 = 102
    修罗战衣 = 103
    罗剎布缀 = 104
    化劲棉衣 = 105
    辟火衫 = 106
    龙王逆鳞甲 = 107
    长生仙袍 = 108
    狂牛战盔 = 109
    无双英雄 = 110
    绝代佳人 = 111
    御风练甲 = 126
    微尘甲 = 129
    焦炎世界 = 132
    薄雾仙衣 = 135
    爪黄飞电 = 138
    琥珀软玉袍 = 141

class ShoesType(IntEnum):
    # 靴子/腰带
    清心紫金带 = 101
    虎皮腰带 = 113
    骷髅腰带 = 114
    疾风腰带 = 115
    星宿腰带 = 116
    月轮腰带 = 117
    日轮腰带 = 118
    枳首蛇 = 119
    不摧腰带 = 120
    伏羲腰带 = 121
    女娲腰带 = 122
    风神之环 = 123
    清心围腰 = 124
    镇风带 = 127
    玄石履 = 130
    六道劫火环 = 133
    冰种环 = 136
    赤龙驹蹄 = 139
    五色琉璃靴 = 142

class AnotherCharaType(IntEnum):
    牛魔王 = 143
    金角 = 144
    银角 = 145
    白骨精 = 146
    黄袍老怪 = 147
    虎力仙 = 148
    羊力仙 = 149
    鹿力仙 = 150
    金鱼精 = 151
    六耳猕猴 = 152
    红孩儿 = 153
    大鹏王 = 154
    白象王 = 155
    青狮王 = 156
    蝎子精 = 157
    小白鼠 = 158
    小蜜蜂 = 159

class ItemType(IntEnum):
    冰箭术 = 160
    钻石尘 = 161
    阎王吐息 = 162
    火海术 = 163
    流星雨 = 164
    天罚 = 165
    雷之墙 = 166
    雷神进军 = 167
    圣裁之墙 = 168
    回头是岸 = 169
    引渡西方 = 170
    永劫轮回 = 171
    神光术 = 172
    神威光连打 = 173
    变异之光 = 174
    巨灵召幻 = 175
    巨灵之怒 = 176
    诸神之舞 = 177
    追魂刀 = 178
    震地弹 = 179
    乱心烟 = 180
    五雷符 = 181
    化毒草 = 182
    万应丹 = 183
    上古龙蛋 = 184
    鬼蜂窝 = 185
    散花镖 = 186
    震天雷 = 187
    齿轮 = 188
    幌金绳 = 189
    紫金葫芦 = 190
    白玉盂 = 191
    人种袋 = 192
    冷龙令 = 193
    五行车 = 194
    阴阳二气瓶 = 195
    倒马毒庄 = 196
    紫金铃 = 197
    召雷令牌 = 198
    雷公锤 = 199
    玲珑塔 = 200
    定风珠 = 201
    风袋 = 202
    落宝金钱 = 203
    神灵护身符 = 204
    四海瓶 = 205
    九天玄冰扇 = 206
    五火神焰扇 = 207
    天将令 = 208